#include <iostream>
using namespace std;

int main() {
    int T;
    cin >> T;
    for (int i=0; i<T; i++) {
        long long N;
        cin >> N;
        cout << (N%10 != 0 ? 0:1) << '\n';
    }

    return 0;
}

// 1   상윤
// 2   상윤
// 3   상윤
// 4   상윤
// 5   상윤
// 6   상윤
// 7   상윤
// 8   상윤
// 9   상윤

// 10  승우
// 11  상윤
// 12  상윤
// 13  상윤     
// 14  상윤
// 15  상윤
// 16  상윤
// 17  상윤
// 18  상윤
// 19  상윤

// 20 승우
// 21 상윤
// 22 상윤
// 23 상윤
// 24 상윤
// 25 상윤
// 26 상윤
// 27 상윤
// 28 상윤
// 29 상윤

// 30 승우
// 31 상윤